starliliko/diy-drone-powered-by-esp32s3/components/core/crazyflie/modules/src/stabilizer.c
/**
 *    ||          ____  _ __
 * +------+      / __ )(_) /_______________ _____  ___
 * | 0xBC |     / __  / / __/ ___/ ___/ __ `/_  / / _ \
 * +------+    / /_/ / / /_/ /__/ /  / /_/ / / /_/  __/
 *  ||  ||    /_____/_/\__/\___/_/   \__,_/ /___/\___/
 *
 * Crazyflie Firmware
 *
 * Copyright (C) 2011-2016 Bitcraze AB
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, in version 3.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 *
 *
 */

#include <math.h>
#include <inttypes.h>

#include "FreeRTOS.h"
#include "task.h"

#include "stm32_legacy.h"
#include "system.h"
#include "log.h"
#include "param.h"
#include "motors.h"
#include "pm_esplane.h"
#include "esp_timer.h"
#include "esp_log.h"
#include "stabilizer.h"
#include "sensors.h"
#include "commander.h"
#include "crtp_localization_service.h"
#include "sitaw.h"
#include "controller.h"
#include "power_distribution.h"
#include "motor_test.h"
// #include "collision_avoidance.h"

#include "estimator.h"
#include "crtp_commander.h"
#include "vehicle_state.h"
// #include "usddeck.h" //usddeckLoggingMode_e
#include "quatcompress.h"
#include "statsCnt.h"
#define DEBUG_MODULE "STAB"
#include "debug_cf.h"
#include "static_mem.h"
#include "rateSupervisor.h"

// ESP-IDF 硬件看门狗
#include "esp_task_wdt.h"

// 硬件看门狗配置
#define STABILIZER_WDT_TIMEOUT_SEC 3 // 3秒无响应则复位

static bool isInit;
static bool emergencyStop = false;                                 // 紧急停止标志
static int emergencyStopTimeout = EMERGENCY_STOP_TIMEOUT_DISABLED; // 紧急停止超时计数器

static bool checkStops;

#define PROPTEST_NBR_OF_VARIANCE_VALUES 100
static bool startPropTest = false;

uint32_t inToOutLatency;

// State variables for the stabilizer
static setpoint_t setpoint;     // 目标设定点（来自遥控/上位机）
static sensorData_t sensorData; // 传感器原始数据（IMU/气压计/磁力计）
static state_t state;           // 当前状态估计（姿态/位置/速度）
static control_t control;       // 控制器输出（roll/pitch/yaw/thrust）

static StateEstimatorType estimatorType; // 状态估计器类型
static ControllerType controllerType;    // 控制器类型

typedef enum
{
  configureAcc,
  measureNoiseFloor,
  measureProp,
  testBattery,
  restartBatTest,
  evaluateResult,
  testDone
} TestState; //
#ifdef RUN_PROP_TEST_AT_STARTUP
static TestState testState = configureAcc;
#else
static TestState testState = testDone;
#endif

static STATS_CNT_RATE_DEFINE(stabilizerRate, 500);
static rateSupervisor_t rateSupervisorContext;
static bool rateWarningDisplayed = false;

static struct
{
  // position - mm
  int16_t x;
  int16_t y;
  int16_t z;
  // velocity - mm / sec
  int16_t vx;
  int16_t vy;
  int16_t vz;
  // acceleration - mm / sec^2
  int16_t ax;
  int16_t ay;
  int16_t az;
  // compressed quaternion, see quatcompress.h
  int32_t quat;
  // angular velocity - milliradians / sec
  int16_t rateRoll;
  int16_t ratePitch;
  int16_t rateYaw;
} stateCompressed;

static struct
{
  // position - mm
  int16_t x;
  int16_t y;
  int16_t z;
  // velocity - mm / sec
  int16_t vx;
  int16_t vy;
  int16_t vz;
  // acceleration - mm / sec^2
  int16_t ax;
  int16_t ay;
  int16_t az;
} setpointCompressed;

static float accVarX[NBR_OF_MOTORS];
static float accVarY[NBR_OF_MOTORS];
static float accVarZ[NBR_OF_MOTORS];
// Bit field indicating if the motors passed the motor test.
// Bit 0 - 1 = M1 passed
// Bit 1 - 1 = M2 passed
// Bit 2 - 1 = M3 passed
// Bit 3 - 1 = M4 passed
static uint8_t motorPass = 0;
static uint16_t motorTestCount = 0;

STATIC_MEM_TASK_ALLOC(stabilizerTask, STABILIZER_TASK_STACKSIZE);

static void stabilizerTask(void *param);
static void testProps(sensorData_t *sensors);

static void calcSensorToOutputLatency(const sensorData_t *sensorData)
{
  uint64_t outTimestamp = usecTimestamp();
  inToOutLatency = outTimestamp - sensorData->interruptTimestamp;
}

static void compressState()
{
  stateCompressed.x = state.position.x * 1000.0f;
  stateCompressed.y = state.position.y * 1000.0f;
  stateCompressed.z = state.position.z * 1000.0f;

  stateCompressed.vx = state.velocity.x * 1000.0f;
  stateCompressed.vy = state.velocity.y * 1000.0f;
  stateCompressed.vz = state.velocity.z * 1000.0f;

  stateCompressed.ax = state.acc.x * 9.81f * 1000.0f;
  stateCompressed.ay = state.acc.y * 9.81f * 1000.0f;
  stateCompressed.az = (state.acc.z + 1) * 9.81f * 1000.0f;

  float const q[4] = {
      state.attitudeQuaternion.x,
      state.attitudeQuaternion.y,
      state.attitudeQuaternion.z,
      state.attitudeQuaternion.w};
  stateCompressed.quat = quatcompress(q);

  float const deg2millirad = ((float)M_PI * 1000.0f) / 180.0f;
  stateCompressed.rateRoll = sensorData.gyro.x * deg2millirad;
  stateCompressed.ratePitch = sensorData.gyro.y * deg2millirad; // gyro.y 已在驱动层对齐，此处无需取反
  stateCompressed.rateYaw = sensorData.gyro.z * deg2millirad;
}

static void compressSetpoint()
{
  setpointCompressed.x = setpoint.position.x * 1000.0f;
  setpointCompressed.y = setpoint.position.y * 1000.0f;
  setpointCompressed.z = setpoint.position.z * 1000.0f;

  setpointCompressed.vx = setpoint.velocity.x * 1000.0f;
  setpointCompressed.vy = setpoint.velocity.y * 1000.0f;
  setpointCompressed.vz = setpoint.velocity.z * 1000.0f;

  setpointCompressed.ax = setpoint.acceleration.x * 1000.0f;
  setpointCompressed.ay = setpoint.acceleration.y * 1000.0f;
  setpointCompressed.az = setpoint.acceleration.z * 1000.0f;
}

void stabilizerInit(StateEstimatorType estimator) // 在system.c中调用
{
  if (isInit)
    return;

  sensorsInit(); // 初始化传感器模块
  if (estimator == anyEstimator)
  {
    estimator = deckGetRequiredEstimator();
  } // 查询扩展板和外设来决定使用哪种状态估计器
  stateEstimatorInit(estimator);     // 初始化状态估计器模块
  controllerInit(ControllerTypeAny); // 初始化控制器模块
  powerDistributionInit();           // 电机初始化
  sitAwInit();                       // 初始化情景感知模块
  // collisionAvoidanceInit(); // 多机避撞模块初始化
  estimatorType = getStateEstimator();
  controllerType = getControllerType();

  // 初始化ESP-IDF任务看门狗（Task Watchdog Timer）
  // 如果stabilizer任务在指定时间内没有喂狗，系统会触发警告或复位
#ifdef CONFIG_ESP_TASK_WDT_EN
  esp_task_wdt_config_t twdt_config = {
      .timeout_ms = STABILIZER_WDT_TIMEOUT_SEC * 1000,
      .idle_core_mask = 0,   // 不监控空闲任务
      .trigger_panic = true, // 超时触发panic（重启）
  };
  esp_task_wdt_reconfigure(&twdt_config);
  DEBUG_PRINT("Hardware watchdog configured: %d sec timeout\n", STABILIZER_WDT_TIMEOUT_SEC);
#endif

  STATIC_MEM_TASK_CREATE(stabilizerTask, stabilizerTask, STABILIZER_TASK_NAME, NULL, STABILIZER_TASK_PRI);

  isInit = true;
}

bool stabilizerTest(void)
{
  bool pass = true;

  pass &= sensorsTest();
  pass &= stateEstimatorTest();
  pass &= controllerTest();
  pass &= powerDistributionTest();
  // pass &= collisionAvoidanceTest();

