starliliko/diy-drone-powered-by-esp32s3/components/core/crazyflie/modules/src/stabilizer.c
  return pass;
}

static void checkEmergencyStopTimeout()
{
  if (emergencyStopTimeout >= 0)
  {
    emergencyStopTimeout -= 1;

    if (emergencyStopTimeout == 0)
    {
      emergencyStop = true;
    }
  }
}

/* The stabilizer loop runs at 1kHz (stock) or 500Hz (kalman). It is the
 * responsibility of the different functions to run slower by skipping call
 * (ie. returning without modifying the output structure).
 */
/*
稳定器循环以1kHz（stock）或500Hz（kalman）的频率运行。
各个函数有责任通过跳过调用（即返回而不修改输出结构）来以较慢的速度运行。

*/
static void stabilizerTask(void *param)
{
  uint32_t tick;
  uint32_t lastWakeTime;

#ifdef configUSE_APPLICATION_TASK_TAG
#if configUSE_APPLICATION_TASK_TAG == 1
  vTaskSetApplicationTaskTag(0, (void *)TASK_STABILIZER_ID_NBR);
#endif
#endif // 设置任务标签

  // 将当前任务添加到看门狗监控
#ifdef CONFIG_ESP_TASK_WDT_EN
  esp_task_wdt_add(NULL); // NULL表示当前任务
  DEBUG_PRINT("Stabilizer task added to hardware watchdog\n");
#endif

  // Wait for the system to be fully started to start stabilization loop
  systemWaitStart();

  DEBUG_PRINTI("Wait for sensor calibration...\n");

  // Wait for sensors to be calibrated
  lastWakeTime = xTaskGetTickCount();
  uint32_t calibWaitCount = 0;
  while (!sensorsAreCalibrated())
  {
    vTaskDelayUntil(&lastWakeTime, F2T(RATE_MAIN_LOOP)); // 周期性延时，控制周期精准
  }

  // Initialize tick to something else then 0
  tick = 1;
  // 等待传感器校准完成

  rateSupervisorInit(&rateSupervisorContext, xTaskGetTickCount(), M2T(1000), 997, 1003, 1);
  // 初始化速率监控器，用于监控稳定器循环的执行频率是否在预期范围内

  DEBUG_PRINTI("Ready to fly.\n");

  // 输出系统启动配置信息
  DEBUG_PRINTI("=== System Config ===");
  DEBUG_PRINTI("Flight Mode: %s", getFlightModeName());
  DEBUG_PRINTI("Estimator: %s (type=%d)", stateEstimatorGetName(), estimatorType);
  DEBUG_PRINTI("Controller: %s (type=%d)", controllerGetName(), controllerType);
  DEBUG_PRINTI("====================");

  while (1)
  {
    // The sensor should unlock at 1kHz
    sensorsWaitDataReady(); // 等待传感器数据准备 //中断触发 1kHz

    // 整个控制环的节拍驱动源
    /*
    这里存在一个问题，bim088中断的驱动频率无法明确确定是1kHz还是800Hz
    需要具体去查看和修改bmi088的配置参数
    */

    if (startPropTest != false)
    {
      // TODO: What happens with estimator when we run tests after startup?
      // 可能会影响状态估计器的运行
      testState = configureAcc;
      startPropTest = false;
    } // 启动后测试

    if (testState != testDone)
    {
      sensorsAcquire(&sensorData, tick); // 采集传感器数据
      testProps(&sensorData);            // 运行电机测试
    }
    else
    {
      // allow to update estimator dynamically
      if (getStateEstimator() != estimatorType)
      {
        stateEstimatorSwitchTo(estimatorType);
        estimatorType = getStateEstimator();
      }
      // allow to update controller dynamically
      if (getControllerType() != controllerType)
      {
        controllerInit(controllerType);
        controllerType = getControllerType();
      } // 动态切换估计器和控制器类型

      stateEstimator(&state, &sensorData, &control, tick); // 状态估计器更新状态

      /*
双任务协同
KF估计器任务在100Hz下运行，通过estimatorKalman接口兼容
*/

      compressState(); // 压缩状态数据以便传输

      // // 输出姿态和传感器数据 (10Hz)
      // static uint16_t debugCount = 0;
      // if (++debugCount >= 100)
      // {
      //   printf("RPY: %.1f,%.1f,%.1f | ACC: %.2f,%.2f,%.2f | GYRO: %.1f,%.1f,%.1f\n",
      //          state.attitude.roll, state.attitude.pitch, state.attitude.yaw,
      //          sensorData.acc.x, sensorData.acc.y, sensorData.acc.z,
      //          sensorData.gyro.x, sensorData.gyro.y, sensorData.gyro.z);
      //   debugCount = 0;
      // }

      // printf("%.2f,%.2f,%.2f\n", state.attitude.roll, state.attitude.pitch, state.attitude.yaw);

      // // 输出系统启动配置信息
      // DEBUG_PRINTI("=== System Config ===");
      // DEBUG_PRINTI("Flight Mode: %s", getFlightModeName());
      // DEBUG_PRINTI("Estimator: %s (type=%d)", stateEstimatorGetName(), estimatorType);
      // DEBUG_PRINTI("Controller: %s (type=%d)", controllerGetName(), controllerType);
      // DEBUG_PRINTI("====================");

      commanderGetSetpoint(&setpoint, &state); // 获取目标设定点
      compressSetpoint();                      // 压缩设定点数据以便传输

      sitAwUpdateSetpoint(&setpoint, &sensorData, &state); // 情景感知模块更新设定点
      // collisionAvoidanceUpdateSetpoint(&setpoint, &sensorData, &state, tick);
      // 多机避撞模块更新设定点

      controller(&control, &setpoint, &sensorData, &state, tick); // 控制器计算控制输出

      // 更新飞行器状态 (PX4风格状态机)
      if (RATE_DO_EXECUTE(100, tick))
      { // 100Hz 更新状态
        vehicleStateUpdate();
      }

      checkEmergencyStopTimeout(); // 检查紧急停机超时

      // 使用新的vehicle_state系统检查解锁状态
      // 电机测试模式时，stabilizer 完全不控制电机，让 motor_test 任务独占
      if (motorTestIsRunning())
      {
        // 电机测试运行中，跳过 powerStop/powerDistribution
        // motor_test 任务会直接调用 motorsSetRatio()
        checkStops = true; // 标记为运行中
      }
      else
      {
        checkStops = vehicleIsArmed();
        if (emergencyStop || !vehicleIsArmed())
        {
          powerStop(); // 停机
        }
        else
        {
          powerDistribution(&control);
          // 投入混控分配
        }
      }

      // TODO: Log data to uSD card if configured
      /*if (usddeckLoggingEnabled()
          && usddeckLoggingMode() == usddeckLoggingMode_SynchronousStabilizer
          && RATE_DO_EXECUTE(usddeckFrequency(), tick)) {
        usddeckTriggerLogging();
      }*/
      // SD卡日志记录（如果配置了）
    }
    calcSensorToOutputLatency(&sensorData); // 计算从传感器数据采集到电机输出的完整延迟时间
    tick++;
    STATS_CNT_RATE_EVENT(&stabilizerRate); // 统计稳定器循环频率

    // 喂狗 - 证明stabilizer任务正常运行
#ifdef CONFIG_ESP_TASK_WDT_EN
    esp_task_wdt_reset();
#endif

    if (!rateSupervisorValidate(&rateSupervisorContext, xTaskGetTickCount()))
    {
      if (!rateWarningDisplayed)
      {
        DEBUG_PRINT("WARNING: stabilizer loop rate is off (%" PRIu32 ")\n", rateSupervisorLatestCount(&rateSupervisorContext));
        rateWarningDisplayed = true;
      }
    } // 监控稳定器循环频率是否在预期范围内
  }
}

void stabilizerSetEmergencyStop()
{
  emergencyStop = true;
}

void stabilizerResetEmergencyStop()
{
  emergencyStop = false;
}

void stabilizerSetEmergencyStopTimeout(int timeout)
{
  emergencyStop = false;
  emergencyStopTimeout = timeout;
}

static float variance(float *buffer, uint32_t length)
{
  uint32_t i;
  float sum = 0;
  float sumSq = 0;

  for (i = 0; i < length; i++)
  {
    sum += buffer[i];
    sumSq += buffer[i] * buffer[i];
  }

  return sumSq - (sum * sum) / length;
}

/** Evaluate the values from the propeller test
 * @param low The low limit of the self test
 * @param high The high limit of the self test
 * @param value The value to compare with.
 * @param string A pointer to a string describing the value.
 * @return True if self test within low - high limit, false otherwise
 */
static bool evaluateTest(float low, float high, float value, uint8_t motor)
{
  if (value < low || value > high)
  {
    DEBUG_PRINTI("Propeller test on M%d [FAIL]. low: %0.2f, high: %0.2f, measured: %0.2f\n",
                 motor + 1, (double)low, (double)high, (double)value);
    return false;
  }

  motorPass |= (1 << motor);

